Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::DuctElbowPreferenceTable::Modifier Class Reference
MEP Element Manager
Modifier of the DuctElbowPreferenceTable. More...
#include <MEPDuctElbowPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::DuctElbowPreferenceTable::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewRow (const Key &key)
Inserts a new row into the table.
Result< void >  | DeleteRow (uint32_t index)
Deletes a row from the table.
Result< void >  | DeleteRowByKey (const Key &key)
Deletes a row from the table.
Result< void >  | SetDiameter (uint32_t index, double diameter)
Sets the diameter value of a table's row.
Result< void >  | SetDiameterByKey (const Key &key, double diameter)
Sets the diameter value of a table's row.
Result< void >  | SetRadius (uint32_t index, double radius)
Sets the radius value of a table's row.
Result< void >  | SetRadiusByKey (const Key &key, double radius)
Sets the radius value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByKey (const Key &key, const GS::UniString &description)
Sets the description of a table's row.
 Protected Member Functions
Modifier (DuctElbowPreferenceTable &parent)
Constructs a Modifier with the given DuctElbowPreferenceTable.
Detailed Description
Modifier of the DuctElbowPreferenceTable.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::DuctElbowPreferenceTable::Modifier::Modifier  |  ( |  DuctElbowPreferenceTable & |  parent | )
protected
Constructs a Modifier with the given DuctElbowPreferenceTable.
Parameters
parent | The given DuctElbowPreferenceTable.
Member Function Documentation
◆ AddNewRow()
 Result< uint32_t > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::AddNewRow  |  ( |  const Key & |  key | )
Inserts a new row into the table.
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Returns
Returns error if the pair of referenceId and angle is already present in the table, otherwise the index of the new row.
◆ DeleteRow()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::DeleteRow  |  ( |  uint32_t |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ DeleteRowByKey()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::DeleteRowByKey  |  ( |  const Key & |  key | )
Deletes a row from the table.
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Returns
Returns error if the pair of referenceId and angle does not occur in the table, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetDescription  |  ( |  uint32_t |  index,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByKey()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetDescriptionByKey  |  ( |  const Key & |  key,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
description | The description to be set.
If no row exists for the given key, but the key contains valid referenceId and angle, it inserts the row.
Returns
Returns error if the referenceId and angle is not in the DuctReferenceSet and DuctAngleSet, otherwise nothing.
◆ SetDiameter()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDiameterByKey()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid referenceId and angle, it inserts the row.
Returns
Returns error if the referenceId and angle is not in the DuctReferenceSet and DuctAngleSet, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetName  |  ( |  const GS::UniString & |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetRadius()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetRadius  |  ( |  uint32_t |  index,
|  double |  radius )
Sets the radius value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
radius | The value to be set. Must be a non-zero positive number. Radius must be greater or equal than 0.6 * diameter.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetRadiusByKey()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modifier::SetRadiusByKey  |  ( |  const Key & |  key,
|  double |  radius )
Sets the radius value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
radius | The value to be set. Must be a non-zero positive number. Radius must be greater or equal than 0.6 * diameter.
If no row exists for the given key, but the key contains valid referenceId and angle, it inserts the row.
Returns
Returns error if the referenceId and angle is not in the DuctReferenceSet and DuctAngleSet, otherwise nothing.